{
  "backend/main.mo": "Defines actor modules for audit logs, user profiles, registration data, services, and tasks with related types and comparisons.",
  "backend/migration.mo": "Provides a migration runner that transforms old actor state into a new actor state.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files and components.",
  "frontend/index.css": "Tailwind setup defining CSS variables for light and dark themes and applying global styles.",
  "frontend/index.html": "HTML entry point setting up root element and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, query client, providers, and links all pages including dashboards and legal pages.",
  "frontend/src/components/AccessGate.tsx": "Component enforcing role-based access by verifying backend user role and status before rendering children.",
  "frontend/src/components/audit/AuditLogTable.tsx": "Empty file placeholder for an audit log table component.",
  "frontend/src/components/BrandLogo.tsx": "Renders brand logo or icon with fixed styling to avoid filters and maintain transparency.",
  "frontend/src/components/CopyRow.tsx": "Read‑only input row with clipboard copy functionality and success toast.",
  "frontend/src/components/DashboardSidebar.tsx": "Dashboard sidebar showing brand logo and clickable menu items with active highlighting.",
  "frontend/src/components/internal-access/AdminInternalAccessPanel.tsx": "Empty file placeholder for an admin internal access panel component.",
  "frontend/src/components/internal-access/InternalAccessPanel.tsx": "Empty file placeholder for an internal access panel component.",
  "frontend/src/components/InternalGateGuard.tsx": "Checks sessionStorage for an internal access gate and shows a lock screen with navigation to the internal page if access is not validated or expired.",
  "frontend/src/components/LandingFooter.tsx": "Renders the landing page footer with a message, WhatsApp link, legal links, and copyright text.",
  "frontend/src/components/LandingHeader.tsx": "Displays a fixed header with navigation, language toggle, and scroll‑responsive styling for the landing page.",
  "frontend/src/components/LanguageToggle.tsx": "Provides a simple EN/ID language switch using the locale provider.",
  "frontend/src/components/LockedPanel.tsx": "Shows a dashed, semi‑transparent card indicating a feature is locked or unavailable.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary component that catches runtime errors and displays a reload prompt with error details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, auto‑initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching the current user and registering clients, partners, and internal users, plus claiming superadmin.",
  "frontend/src/index.css": "Tailwind base/theme configuration defining CSS variables for light and dark modes along with global styles.",
  "frontend/src/lib/brand.ts": "Exports static paths for brand asset images.",
  "frontend/src/lib/forms/registrationSchemas.ts": "Defines client and partner form data interfaces and lists their corresponding form field configurations.",
  "frontend/src/lib/i18n.ts": "Provides locale types and a large enumeration of translation keys for the app’s i18n system.",
  "frontend/src/lib/whatsapp.ts": "Defines preset WhatsApp messages and builds encoded WhatsApp links for various site sections.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with role‑gated access and menu‑based sections for summary, users, and internal access.",
  "frontend/src/pages/client/ClientDashboardPage.tsx": "Client dashboard showing greeting, profile data, and tabbed workspace sections using user query data.",
  "frontend/src/pages/internal/AsistenmuDashboardPage.tsx": "Internal Asistenmu dashboard with gated access and simple localized placeholder content.",
  "frontend/src/pages/internal/FinanceDashboardPage.tsx": "Renders an internal finance dashboard with localized text inside an AccessGate requiring FINANCE role.",
  "frontend/src/pages/internal/InternalRoleMismatchPage.tsx": "Displays a role‑mismatch warning with a button to return to the internal login page.",
  "frontend/src/pages/internal/ManagementDashboardPage.tsx": "Renders the management dashboard with localized content, wrapped in an AccessGate for MANAGEMENT role.",
  "frontend/src/pages/internal/SupervisorDashboardPage.tsx": "Provides a supervisor dashboard with localized sections, accessible only to SUPERVISOR users.",
  "frontend/src/pages/InternalGatePage.tsx": "Implements an internal access gate page with mock code verification and navigation logic.",
  "frontend/src/pages/InternalLoginPage.tsx": "Handles internal login, role-based workspace access, and optional superadmin claiming.",
  "frontend/src/pages/InternalRegisterPage.tsx": "Allows internal users to register by selecting a role and submitting via backend mutation.",
  "frontend/src/pages/KebijakanPrivasiPage.tsx": "Displays the privacy policy page with basic content and a button to return to the homepage.",
  "frontend/src/pages/LandingPage.tsx": "Landing page rendering hero content, service listings, and navigation actions with localization.",
  "frontend/src/pages/LoginPage.tsx": "Login page handling Internet Identity auth and role‑based workspace routing with error states.",
  "frontend/src/pages/partner/PartnerDashboardPage.tsx": "Implements the partner dashboard with sidebar navigation, user data display, and localized menu sections.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page for client and partner accounts with form handling, mutations, and success/error states.",
  "frontend/src/pages/superadmin/SuperadminDashboardPage.tsx": "Implements a superadmin dashboard with multiple menu sections, accessible via SUPERADMIN role.",
  "frontend/src/pages/SyaratKetentuanPage.tsx": "Static terms and conditions page with basic layout and navigation back to home.",
  "frontend/src/providers/LocaleProvider.tsx": "Context provider managing current locale with persistence and a hook for access.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session‑persisted values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, extensions, and plugins.",
  "project_state.json": "Defines project state, architecture rules, constraints, and known issues for extending the backend with new core modules. Lists required behaviors, restrictions, and current bugs affecting routing, authentication, and internal access flows."
}