{
  "backend/main.mo": "Defines backend data models and DTO modules for users, registration, audit logs, services, and internal code types.",
  "feature_evidence.json": "Lists feature evidence entries describing frontend changes, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme tokens and global base styles.",
  "frontend/index.html": "HTML entrypoint that loads the React app and sets favicon and root container.",
  "frontend/src/App.tsx": "Main React entry that configures TanStack Router routes, QueryClient, and global providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen showing an access denied message with a button redirecting to internal login.",
  "frontend/src/components/AccessGate.tsx": "Component that verifies user role and status via backend before rendering protected content or denying access.",
  "frontend/src/components/audit/AuditLogTable.tsx": "Empty placeholder file for an audit log table component.",
  "frontend/src/components/BrandLogo.tsx": "Simple brand logo renderer selecting horizontal or icon variant with hardened styling.",
  "frontend/src/components/client/ClientDelegasiLockState.tsx": "Gates client features based on active layanan status and disables children when no active service exists.",
  "frontend/src/components/client/ClientLayanankuTab.tsx": "Displays the client's layanan list with status badges, dates, and shared principals, handling loading and empty states.",
  "frontend/src/components/client/ClientServiceRequestTab.tsx": "Form for creating service requests plus a list of existing tasks with request type badges and date formatting.",
  "frontend/src/components/CopyRow.tsx": "Displays a read‑only input with a button to copy a value to clipboard and shows success/error toasts.",
  "frontend/src/components/customer-service/CustomerServiceGuideTab.tsx": "Displays a read-only customer service guide with instructions for checking users, services, tasks, and escalation flows.",
  "frontend/src/components/customer-service/CustomerServiceServiceManagementView.tsx": "Provides a read-only searchable list of services with filtering, details, and availability/status badges.",
  "frontend/src/components/customer-service/CustomerServiceSummaryView.tsx": "Shows summary metrics for partners, internal users, services, and tasks along with a dashboard intro card.",
  "frontend/src/components/customer-service/CustomerServiceTaskManagementView.tsx": "Implements task search, filtering, pagination, and status-grouped task cards with a task detail dialog.",
  "frontend/src/components/customer-service/CustomerServiceTicketsTab.tsx": "Allows creating and storing UI-only escalation tickets with category, summary, priority, and localStorage persistence.",
  "frontend/src/components/customer-service/CustomerServiceUserDetailPanel.tsx": "Displays a read-only dialog with user details including client, partner, and internal data sections.",
  "frontend/src/components/customer-service/CustomerServiceUserManagementView.tsx": "Displays read‑only user and partner management, including search results and partner status sections. Handles selecting users and fetching data via management hooks.",
  "frontend/src/components/customer-service/ReadOnlyPartnerStatusSection.tsx": "Renders a collapsible list of partners for a given status, handling loading, error, and empty states. Clicking a partner triggers a selection callback.",
  "frontend/src/components/DashboardSidebar.tsx": "Renders a sidebar with a logo and menu buttons, highlighting the active item.",
  "frontend/src/components/internal-access/AdminInternalAccessPanel.tsx": "Empty file.",
  "frontend/src/components/internal-access/InternalAccessPanel.tsx": "Empty file.",
  "frontend/src/components/internal/asistenmu/AsistenmuDelegationView.tsx": "Provides a Delegation view with subtabs to switch between incoming requests and task delegation creation. Wraps content in a card layout.",
  "frontend/src/components/internal/asistenmu/CreateDelegationTab.tsx": "Form for loading a task and sending a delegation to a partner, including validation and task assignment/status update calls. Shows loaded task summary and resets fields after submission.",
  "frontend/src/components/internal/asistenmu/DelegationSubtabs.tsx": "Renders two buttons for switching between Incoming Requests and Create Delegation views.",
  "frontend/src/components/internal/asistenmu/IncomingRequestsTab.tsx": "Loads and displays incoming task requests with expandable details. Handles loading, error, and empty states.",
  "frontend/src/components/internal/asistenmu/LoadedTaskSummary.tsx": "Shows a compact summary of a loaded task, including ID, title, description, type badge, and placeholder deadline.",
  "frontend/src/components/internal/asistenmu/TaskDetailPanel.tsx": "Displays full task details for a selected task with loading and error handling. Includes a close button and formatted status display.",
  "frontend/src/components/internal/asistenmu/TaskRow.tsx": "Displays a task row with expand toggle, status badges, and formatted metadata.",
  "frontend/src/components/internal/MyProfileCard.tsx": "Shows and edits the logged‑in internal user's profile with form fields, loading/error states, and update functionality. Supports copyable IDs and editing internal profile data.",
  "frontend/src/components/InternalGateGuard.tsx": "Protects internal pages by checking a session-based access gate and redirects users to an access screen if not validated.",
  "frontend/src/components/LandingFooter.tsx": "Landing page footer with WhatsApp contact link, policy links, and copyright text.",
  "frontend/src/components/LandingHeader.tsx": "Sticky landing page header with navigation links, language toggle, and auth buttons that react to scroll state.",
  "frontend/src/components/LanguageToggle.tsx": "Two-button language switcher for toggling between English and Indonesian.",
  "frontend/src/components/layanan/BuatLayananForm.tsx": "Form to create a new service, including validation, share management, and assigning an Asistenmu.",
  "frontend/src/components/layanan/DaftarLayananTable.tsx": "Table listing services with actions for viewing details, updating shares, editing Asistenmu, and deactivating.",
  "frontend/src/components/layanan/EditAsistenmuModal.tsx": "Modal to change the Asistenmu assigned to a service using selectable candidate options.",
  "frontend/src/components/layanan/LayananDetailModal.tsx": "Modal showing detailed information for a service including status, dates, and share principals.",
  "frontend/src/components/layanan/LayananUpdateModal.tsx": "Modal for editing a service’s share principals with add/remove inputs and update submission.",
  "frontend/src/components/layanan/ManajemenLayananView.tsx": "Displays and filters services with search, categorization, and creation handling, rendering grouped service lists with status badges.",
  "frontend/src/components/LockedPanel.tsx": "Card component that displays a lock icon and message indicating a disabled or unavailable feature.",
  "frontend/src/components/partner/income/PartnerWalletCard.tsx": "Fetches and shows a partner's wallet balance, earnings, and pending payouts with loading and error states.",
  "frontend/src/components/partner/work/PartnerTaskCard.tsx": "Renders a compact task card with badges, deadline, and a detail button, triggering onClick when selected.",
  "frontend/src/components/partner/work/PartnerTaskDetailDialog.tsx": "Displays detailed task info in a dialog with actions for accepting, rejecting, and requesting QA based on task state.",
  "frontend/src/components/partner/work/PartnerTaskList.tsx": "Lists partner tasks using PartnerTaskCard or shows an empty state message if none exist.",
  "frontend/src/components/partner/work/PartnerWorkTabs.tsx": "Organizes partner tasks into tabbed categories and opens task detail dialogs based on selection.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary that catches runtime errors and shows a reload prompt with error details.",
  "frontend/src/components/superadmin/ActiveClientDetailDialog.tsx": "Shows read-only client details in a dialog, including IDs, role, status, and optional profile fields.",
  "frontend/src/components/superadmin/ActiveClientsCard.tsx": "Displays a table of active client profiles with loading/error states and a detail dialog trigger.",
  "frontend/src/components/superadmin/CollapsibleCardSection.tsx": "A generic card section with toggleable collapse behavior and optional mounted content.",
  "frontend/src/components/superadmin/InternalPendingRegistrationCard.tsx": "Shows internal users pending approval with logic for approving or rejecting each entry.",
  "frontend/src/components/superadmin/PartnerDetailsDialog.tsx": "Dialog that fetches and displays partner performance metrics with loading and error handling.",
  "frontend/src/components/superadmin/PartnerEditDialog.tsx": "Dialog for updating a partner's level and auto-calculated hourly rate, with mutation and validation.",
  "frontend/src/components/superadmin/PartnerStatusSection.tsx": "Manages partner actions—approve, reject, suspend, blacklist, reactivate—and shows status-specific tables.",
  "frontend/src/components/superadmin/SuperadminInternalAccessCodesSettingsView.tsx": "View for reading and updating internal access codes with form handling and mutation feedback.",
  "frontend/src/components/superadmin/SuperadminTaskDetailDialog.tsx": "Dialog component that fetches and displays detailed information about a specific internal task with status and request type badges.",
  "frontend/src/components/superadmin/SuperadminTaskManagementView.tsx": "Task management interface providing filters, stats, pagination, and detailed task viewing for superadmins.",
  "frontend/src/components/superadmin/SuperadminTaskStatsGrid.tsx": "Grid component rendering task statistics in individual cards with icons.",
  "frontend/src/components/superadmin/TruncatedPrincipalCell.tsx": "UI cell that truncates a principal ID and provides a copy-to-clipboard button with feedback.",
  "frontend/src/components/superadmin/UserManagementView.tsx": "Main user management dashboard handling search, partner status sections, internal user approvals, and active client data.",
  "frontend/src/components/superadmin/UserRoleUsersCard.tsx": "Collapsible table listing internal users by role with status indicators and error/loading states.",
  "frontend/src/components/superadmin/UserSearchBar.tsx": "Search bar allowing queries by user ID, principal ID, or name with clear and submit actions.",
  "frontend/src/components/tasks/TaskListCard.tsx": "Client-facing task list card showing task summaries, request type badges, and creation/deadline dates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useAsistenmuAssignment.ts": "Provides stubs for fetching Asistenmu candidates and assigning them to Layananku, with React Query mutations and toasts.",
  "frontend/src/hooks/useAsistenmuDelegation.ts": "Fetches incoming tasks and task details for Asistenmu and provides mutations to assign tasks or update task status.",
  "frontend/src/hooks/useClientServiceRequests.ts": "Contains stubbed hooks for creating client service requests and fetching client tasks, with basic error handling.",
  "frontend/src/hooks/useInternalAccessCodes.ts": "Allows superadmins to fetch and update internal access codes using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useLayananku.ts": "Includes stubbed hooks for creating, fetching, and updating Layananku records for various user roles.",
  "frontend/src/hooks/usePartnerWallet.ts": "Fetches placeholder partner wallet data until backend wallet support is implemented.",
  "frontend/src/hooks/usePartnerWork.ts": "Provides hooks for partners to fetch tasks and update task statuses, invalidating related caches on changes.",
  "frontend/src/hooks/useQueries.ts": "Implements generic user, profile, registration, and superadmin-related queries and mutations using the backend actor.",
  "frontend/src/hooks/useServiceManagement.ts": "Provides a React Query hook to search services and clients by mapping UI search modes to backend modes.",
  "frontend/src/hooks/useSuperadminTasks.ts": "Defines hooks for superadmin to fetch all internal tasks and retrieve task details by ID.",
  "frontend/src/hooks/useSuperadminUserManagement.ts": "Includes multiple hooks for superadmin user search and fetching partners, internal users, and clients with filtering options.",
  "frontend/src/hooks/useTasks.ts": "Exports a hook for fetching all client tasks via the internal tasks API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/src/lib/brand.ts": "Exports paths to static brand asset images.",
  "frontend/src/lib/forms/registrationSchemas.ts": "Defines form data interfaces and field configurations for client and partner registration forms.",
  "frontend/src/lib/i18n.ts": "Declares locale types and a comprehensive list of translation keys for English and Indonesian UI strings.",
  "frontend/src/lib/internalRoles.ts": "Defines internal role metadata, login routes, and utilities for resolving route paths from role IDs.",
  "frontend/src/lib/partnerWorkSorting.ts": "Provides task-sorting logic based on request priority and deadlines.",
  "frontend/src/lib/partnerWorkStatusMapping.ts": "Maps task statuses and request types to UI labels, badge variants, and supports tab-based task filtering.",
  "frontend/src/lib/superadminUserMapping.ts": "Contains mapping utilities between UI and backend enums for partner levels, statuses, and rate formatting.",
  "frontend/src/lib/whatsapp.ts": "Defines preset WhatsApp messages and utilities for generating shareable WhatsApp links.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider setup.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with sidebar-driven navigation for summary, user management, service management, tasks, and settings.",
  "frontend/src/pages/client/ClientDashboardPage.tsx": "Client dashboard showing greeting, profile info, and multiple tabs for summary, profile, services, requests, and delegation.",
  "frontend/src/pages/internal/AsistenmuDashboardPage.tsx": "Asistenmu internal dashboard displaying profile info and a delegation management view.",
  "frontend/src/pages/internal/CustomerServiceDashboardPage.tsx": "Customer service dashboard with sidebar navigation for summary, user/service/task management, guides, and tickets.",
  "frontend/src/pages/internal/FinanceDashboardPage.tsx": "Finance dashboard showing profile details and placeholder finance overview content.",
  "frontend/src/pages/internal/InternalRoleMismatchPage.tsx": "Error page indicating role mismatch with a prompt to return to internal login.",
  "frontend/src/pages/internal/ManagementDashboardPage.tsx": "Management dashboard showing profile info and placeholder management overview content.",
  "frontend/src/pages/internal/SupervisorDashboardPage.tsx": "Renders the supervisor dashboard with profile info, localized headings, and a placeholder card behind an access gate.",
  "frontend/src/pages/InternalGatePage.tsx": "Gate page handling Internet Identity login, setting session flags, and navigating to internal login or registration routes.",
  "frontend/src/pages/InternalLoginPage.tsx": "Internal login page that validates roles, checks superadmin status, and routes authenticated users to their workspace.",
  "frontend/src/pages/InternalRegisterPage.tsx": "Internal user registration page allowing authenticated users to submit role-based profiles and navigate to their workspace.",
  "frontend/src/pages/KebijakanPrivasiPage.tsx": "Static privacy policy page with basic text and a button returning to the homepage.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page showing hero content, service details, and navigation to signup or login.",
  "frontend/src/pages/LoginPage.tsx": "Public login page using Internet Identity to authenticate users and route them to client or partner dashboards.",
  "frontend/src/pages/partner/PartnerBlockedPage.tsx": "Displays a centered card informing a partner user that their account is blocked with support guidance.",
  "frontend/src/pages/partner/PartnerDashboardPage.tsx": "Shows the partner dashboard with menu-driven sections, status-based alerts, and redirects blacklisted users to the blocked page.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page with tabs and forms for client and partner signup, handling authentication, submission, and success navigation.",
  "frontend/src/pages/superadmin/SuperadminDashboardPage.tsx": "Implements the superadmin dashboard with a sidebar menu, profile card, and various management views behind access control.",
  "frontend/src/pages/SyaratKetentuanPage.tsx": "Static terms and conditions page with a card layout and a button to return to the homepage.",
  "frontend/src/providers/LocaleProvider.tsx": "Provides app-wide locale state with persistence and a hook to access or update the current locale.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, and clearing URL or session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, color variables, container settings, and plugins.",
  "project_state.json": "Contains project metadata, architectural notes, issues, and feature requests related to internal user approval and status refresh."
}