{
  "backend/main.mo": "Defines backend actor with user, registration, service, access code, and audit log types used across authorization and internal workflows.",
  "feature_evidence.json": "Lists implemented features with related files, components, and test IDs for verification tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files used across the project for documentation or tooling.",
  "frontend/index.css": "Sets Tailwind base styles and CSS variables for light/dark themes and global UI tokens.",
  "frontend/index.html": "Basic HTML entry point linking the React app root and main script.",
  "frontend/src/App.tsx": "Configures React Query, theme provider, and TanStack Router with all application routes including internal and dashboard pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with branding and a button to return to internal login.",
  "frontend/src/components/AccessGate.tsx": "Component that verifies caller user role and status via backend before rendering protected content, with mismatch and denied handling.",
  "frontend/src/components/audit/AuditLogTable.tsx": "Empty placeholder file for an audit log table component.",
  "frontend/src/components/BrandLogo.tsx": "Simple logo component rendering horizontal or icon variants with hardened styling.",
  "frontend/src/components/client/ClientDelegasiLockState.tsx": "Gates child components based on whether the user has an active service, showing alerts when loading, error, or inactive.",
  "frontend/src/components/client/ClientLayanankuTab.tsx": "Displays the client’s service list with status badges, dates, assistant info, and shared principals.",
  "frontend/src/components/client/ClientServiceRequestTab.tsx": "Form for creating service requests plus a list of existing tasks with request type badges and formatted dates.",
  "frontend/src/components/CopyRow.tsx": "Renders a label, read‑only input, and copy‑to‑clipboard button with success/error toasts.",
  "frontend/src/components/customer-service/CustomerServiceGuideTab.tsx": "Displays a customer service guide with instructions for checking users, services, tasks, and escalation flow.",
  "frontend/src/components/customer-service/CustomerServiceServiceManagementView.tsx": "Read-only service management view with search filtering and detailed service cards.",
  "frontend/src/components/customer-service/CustomerServiceSummaryView.tsx": "Shows summary metrics for partners, users, services, and tasks along with a read‑only dashboard intro.",
  "frontend/src/components/customer-service/CustomerServiceTaskManagementView.tsx": "Provides task search, filtering, pagination, and detailed task views for internal tasks.",
  "frontend/src/components/customer-service/CustomerServiceTicketsTab.tsx": "UI-only form to create and store escalation tickets locally with priority and category fields.",
  "frontend/src/components/customer-service/CustomerServiceUserDetailPanel.tsx": "Dialog showing read-only user details including client, partner, and internal data sections.",
  "frontend/src/components/customer-service/CustomerServiceUserManagementView.tsx": "Provides a read-only user and partner management UI with search, status sections, and a detail panel.",
  "frontend/src/components/customer-service/ReadOnlyPartnerStatusSection.tsx": "Displays a collapsible list of partners by status with loading/error states and user click handling.",
  "frontend/src/components/DashboardSidebar.tsx": "Displays a sidebar with a logo and clickable menu items highlighting the active section.",
  "frontend/src/components/internal-access/AdminInternalAccessPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/internal-access/InternalAccessPanel.tsx": "Empty placeholder component file.",
  "frontend/src/components/internal/asistenmu/AsistenmuDelegationView.tsx": "Renders delegation management UI with subtabs for incoming requests and creating delegations.",
  "frontend/src/components/internal/asistenmu/CreateDelegationTab.tsx": "Form for loading a task and sending a delegation to a partner, including validation and API mutations.",
  "frontend/src/components/internal/asistenmu/DelegationSubtabs.tsx": "Two-button tab selector for switching between incoming and create delegation views.",
  "frontend/src/components/internal/asistenmu/IncomingRequestsTab.tsx": "Shows incoming task requests with expandable rows and a detail panel.",
  "frontend/src/components/internal/asistenmu/LoadedTaskSummary.tsx": "Displays a loaded task’s basic info and request type badge in a summary card.",
  "frontend/src/components/internal/asistenmu/TaskDetailPanel.tsx": "Fetches and displays detailed task information with status, metadata, and a close button.",
  "frontend/src/components/internal/asistenmu/TaskRow.tsx": "Row component showing brief task info, type/status badges, and expand/collapse behavior.",
  "frontend/src/components/InternalGateGuard.tsx": "Protects internal pages by checking a session-based access gate and redirecting users to unlock if expired or missing.",
  "frontend/src/components/LandingFooter.tsx": "Landing page footer with WhatsApp contact link, policy links, and copyright text.",
  "frontend/src/components/LandingHeader.tsx": "Sticky landing header with navigation links, language toggle, and login/register buttons that react to scroll.",
  "frontend/src/components/LanguageToggle.tsx": "Provides EN/ID language switcher buttons based on current locale.",
  "frontend/src/components/layanan/BuatLayananForm.tsx": "Form to create a new service, handle validation, share principals, and assign an assistant, then reset and trigger success callback.",
  "frontend/src/components/layanan/DaftarLayananTable.tsx": "Displays a table of user services with detail, update, assistant-edit, and deactivate actions, refreshing on trigger.",
  "frontend/src/components/layanan/EditAsistenmuModal.tsx": "Modal allowing selection and reassignment of an assistant to an existing service.",
  "frontend/src/components/layanan/LayananDetailModal.tsx": "Read-only modal showing service details including status, dates, and share principals.",
  "frontend/src/components/layanan/LayananUpdateModal.tsx": "Modal to edit and save a service's share principals list with add/remove support.",
  "frontend/src/components/layanan/ManajemenLayananView.tsx": "Main management view for services with search, filtering, categorization, and service creation refresh handling.",
  "frontend/src/components/LockedPanel.tsx": "Shows a dimmed card with lock icon indicating a feature is unavailable.",
  "frontend/src/components/partner/income/PartnerWalletCard.tsx": "Displays partner wallet data with loading and error states, showing balance, earnings, and pending payouts.",
  "frontend/src/components/partner/work/PartnerTaskCard.tsx": "Renders a clickable task card with badges, title, description, and deadline for partner tasks.",
  "frontend/src/components/partner/work/PartnerTaskDetailDialog.tsx": "Shows a dialog with full task details and actions like accept, reject, and request QA based on task status and tab.",
  "frontend/src/components/partner/work/PartnerTaskList.tsx": "Lists partner tasks or shows an empty state, rendering each task as a PartnerTaskCard.",
  "frontend/src/components/partner/work/PartnerWorkTabs.tsx": "Provides tabbed views for partner tasks across multiple statuses and opens task details in a dialog.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary that catches runtime errors and displays a reload prompt with error details.",
  "frontend/src/components/superadmin/ActiveClientDetailDialog.tsx": "Displays a read‑only dialog showing detailed information about a selected active client.",
  "frontend/src/components/superadmin/ActiveClientsCard.tsx": "Shows a table of active clients with loading and error handling and allows opening a detail dialog.",
  "frontend/src/components/superadmin/CollapsibleCardSection.tsx": "A card section with toggleable expansion for showing or hiding arbitrary content.",
  "frontend/src/components/superadmin/InternalPendingRegistrationCard.tsx": "Displays pending internal user registrations in a table with approve/reject actions and handles loading and error states.",
  "frontend/src/components/superadmin/PartnerDetailsDialog.tsx": "Shows a dialog with partner performance metrics, handling loading and error states.",
  "frontend/src/components/superadmin/PartnerEditDialog.tsx": "Dialog for updating a partner's level and auto-calculated hourly rate, submitting changes via mutation.",
  "frontend/src/components/superadmin/PartnerStatusSection.tsx": "Manages partner status lists with actions like approve, reject, suspend, blacklist, reactivate, plus dialogs for details and editing.",
  "frontend/src/components/superadmin/SuperadminInternalAccessCodesSettingsView.tsx": "Allows viewing and updating internal access codes with validation, loading, and error handling.",
  "frontend/src/components/superadmin/SuperadminTaskDetailDialog.tsx": "Dialog that loads and displays detailed task information including status, type, and timestamps.",
  "frontend/src/components/superadmin/SuperadminTaskManagementView.tsx": "Task management UI for superadmins with filtering, period selection, status badges, and task detail dialog integration.",
  "frontend/src/components/superadmin/SuperadminTaskStatsGrid.tsx": "Displays task statistics in a grid of cards with icons and counts.",
  "frontend/src/components/superadmin/TruncatedPrincipalCell.tsx": "Renders a truncated principal ID with a copy-to-clipboard button and toast feedback.",
  "frontend/src/components/superadmin/UserManagementView.tsx": "Main user management interface handling user search, partner status sections, active clients, and internal user approval flows.",
  "frontend/src/components/superadmin/UserRoleUsersCard.tsx": "Collapsible table showing users by role with status badges, loading states, and error handling.",
  "frontend/src/components/superadmin/UserSearchBar.tsx": "Search bar allowing queries by user ID, principal ID, or name with clear and submit actions.",
  "frontend/src/components/tasks/TaskListCard.tsx": "Displays a client task list with request type badges, statuses, and formatted dates using locale‑aware labels.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useAsistenmuAssignment.ts": "Provides stubbed hooks for fetching Asistenmu candidates and assigning them, with mutation error handling.",
  "frontend/src/hooks/useAsistenmuDelegation.ts": "Provides hooks for fetching and updating Asistenmu task data, including incoming tasks, task details, assignment, and status changes using react-query.",
  "frontend/src/hooks/useClientServiceRequests.ts": "Contains stubbed hooks for creating and retrieving client service requests, with placeholder backend logic and toast notifications.",
  "frontend/src/hooks/useInternalAccessCodes.ts": "Defines hooks for verifying, fetching, and updating internal access codes, supporting SUPERADMIN operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage authentication state, login, logout, and stored identities.",
  "frontend/src/hooks/useLayananku.ts": "Offers stubbed hooks for creating and managing Layananku service records, including internal, client, and share updates.",
  "frontend/src/hooks/usePartnerWallet.ts": "Provides a placeholder hook returning a static partner wallet structure until backend support is added.",
  "frontend/src/hooks/usePartnerWork.ts": "Contains hooks for partners to fetch their tasks, retrieve task details, and update task status with cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Includes user-related hooks for registration, profile retrieval, superadmin claiming, and service fetching.",
  "frontend/src/hooks/useServiceManagement.ts": "Implements a search hook mapping UI search modes to backend modes for querying services and clients.",
  "frontend/src/hooks/useSuperadminTasks.ts": "Provides hooks for SUPERADMIN to fetch all internal tasks and specific task details.",
  "frontend/src/hooks/useSuperadminUserManagement.ts": "Defines React Query hooks for superadmin user search and fetching partners, internal users, and customer service users using an actor API.",
  "frontend/src/hooks/useTasks.ts": "Provides a React Query hook to fetch all client tasks for internal roles via the actor API.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light and dark themes and applies global background and text colors.",
  "frontend/src/lib/brand.ts": "Exports static paths for brand asset images including hero, horizontal logo, and icon.",
  "frontend/src/lib/forms/registrationSchemas.ts": "Defines TypeScript interfaces and field configurations for client and partner registration forms.",
  "frontend/src/lib/i18n.ts": "Declares locale types and a large union of translation keys used for frontend internationalization.",
  "frontend/src/lib/partnerWorkSorting.ts": "Implements task sorting for partners based on request priority and deadlines.",
  "frontend/src/lib/partnerWorkStatusMapping.ts": "Provides mappings for task statuses and request types to UI tabs, badges, and labels, plus filtering utilities.",
  "frontend/src/lib/superadminUserMapping.ts": "Maps UI partner levels and user statuses to backend enums and provides hourly rate helpers and formatting.",
  "frontend/src/lib/whatsapp.ts": "Defines preset WhatsApp messages and utilities to build WhatsApp links for various site sections.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and mounts the root component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with a sidebar menu that switches between summary, user management, service management, task, and settings views, wrapped in an admin-only access gate.",
  "frontend/src/pages/client/ClientDashboardPage.tsx": "Client workspace page showing greeting, profile info, services, requests, and delegation tabs with localization support and access control.",
  "frontend/src/pages/internal/AsistenmuDashboardPage.tsx": "Internal Asistenmu dashboard displaying title, description, and the delegation management view behind an access gate for ASISTENMU role.",
  "frontend/src/pages/internal/CustomerServiceDashboardPage.tsx": "Customer service dashboard with a sidebar to switch between summary, user management, service management, tasks, guide, and ticket views, restricted to CS role.",
  "frontend/src/pages/internal/FinanceDashboardPage.tsx": "Finance dashboard showing localized headers and a placeholder finance card, accessible only to FINANCE role.",
  "frontend/src/pages/internal/InternalRoleMismatchPage.tsx": "Displays a role mismatch warning with a button redirecting users back to the internal login page.",
  "frontend/src/pages/internal/ManagementDashboardPage.tsx": "Management dashboard showing localized headers and a placeholder card, restricted to MANAGEMENT role.",
  "frontend/src/pages/internal/SupervisorDashboardPage.tsx": "Supervisor dashboard with localized titles and a placeholder card, accessible only to SUPERVISOR role.",
  "frontend/src/pages/InternalGatePage.tsx": "Implements the internal access gate page with code verification, error handling, and navigation logic.",
  "frontend/src/pages/InternalLoginPage.tsx": "Implements internal role-based login flow using Internet Identity and backend role validation before routing to dashboards.",
  "frontend/src/pages/InternalRegisterPage.tsx": "Handles registration for internal roles and customer service users, then validates and routes them to the appropriate workspace.",
  "frontend/src/pages/KebijakanPrivasiPage.tsx": "Displays the platform’s privacy policy with a simple layout and navigation back to the homepage.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public marketing landing page with hero content, service listings, localized text, and navigation to register or login.",
  "frontend/src/pages/LoginPage.tsx": "Provides public login for clients and partners using Internet Identity and redirects based on validated user role.",
  "frontend/src/pages/partner/PartnerBlockedPage.tsx": "Blocked account page informing partners their access is disabled and advising them to contact support.",
  "frontend/src/pages/partner/PartnerDashboardPage.tsx": "Renders the partner dashboard with menu-based sections, user-status alerts, and redirects blacklisted users.",
  "frontend/src/pages/RegisterPage.tsx": "Supports client and partner registration with form inputs, backend submission, and success handling.",
  "frontend/src/pages/superadmin/SuperadminDashboardPage.tsx": "Provides the superadmin dashboard with menu-driven views for users, services, tasks, audit logs, and settings.",
  "frontend/src/pages/SyaratKetentuanPage.tsx": "Shows the platform’s terms and conditions with a simple card layout and a button to return to the homepage.",
  "frontend/src/providers/LocaleProvider.tsx": "Implements a React context for storing and updating the app's locale with persistence to localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, container settings, and plugin usage.",
  "project_state.json": "Project metadata describing required features, issues, and architecture notes for internal access-code verification and superadmin settings."
}