{
  "backend/main.mo": "Defines the actor with user, service, task, audit-log, and access‑code related types and modules, plus applies migration on upgrade.",
  "backend/migration.mo": "Adds a requestType field (default NORMAL) to each stored task record during upgrade mapping.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for documentation or analysis.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark modes with global styling rules.",
  "frontend/index.html": "Basic HTML entry file mounting the root element and loading the React application.",
  "frontend/src/App.tsx": "Sets up the router, global providers, and all top‑level application routes using TanStack Router and React Query.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Renders an access‑denied UI with branding and a button redirecting users back to internal login.",
  "frontend/src/components/AccessGate.tsx": "Verifies user role and status before rendering protected content, showing errors or access-denied screens if checks fail.",
  "frontend/src/components/audit/AuditLogTable.tsx": "Empty placeholder file for an audit log table component.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo image in horizontal or icon variant.",
  "frontend/src/components/client/ClientDelegasiLockState.tsx": "Gates child content based on whether the client has an active layanan, showing alerts when unavailable.",
  "frontend/src/components/client/ClientLayanankuTab.tsx": "Fetches and displays the client's layanan list with status badges and service details.",
  "frontend/src/components/client/ClientServiceRequestTab.tsx": "Form and list UI for clients to submit service requests and view existing tasks, handling submission, validation, and request type badges.",
  "frontend/src/components/CopyRow.tsx": "Displays a labeled read-only value with a button to copy it to the clipboard.",
  "frontend/src/components/DashboardSidebar.tsx": "Sidebar menu with logo and buttons for navigating between dashboard sections.",
  "frontend/src/components/internal-access/AdminInternalAccessPanel.tsx": "Empty placeholder file for admin internal access panel.",
  "frontend/src/components/internal-access/InternalAccessPanel.tsx": "Empty placeholder file for internal access panel.",
  "frontend/src/components/InternalGateGuard.tsx": "Checks session-based internal gate access and redirects users to internal unlock flow if expired or missing.",
  "frontend/src/components/LandingFooter.tsx": "Landing page footer with contact link, legal links, and copyright text.",
  "frontend/src/components/LandingHeader.tsx": "Sticky landing page header with navigation, language toggle, and auth buttons that react to scroll state.",
  "frontend/src/components/LanguageToggle.tsx": "Two-button toggle allowing switching between English and Indonesian locales.",
  "frontend/src/components/layanan/BuatLayananForm.tsx": "Form to create a new layanan, assign an asistenmu, manage share principals, and submit creation followed by assignment.",
  "frontend/src/components/layanan/DaftarLayananTable.tsx": "Displays a table of user layanan with details, status, and actions for viewing, updating, editing asistenmu, and deactivating.",
  "frontend/src/components/layanan/EditAsistenmuModal.tsx": "Modal for updating the assigned asistenmu of a layanan, including candidate selection and save handling.",
  "frontend/src/components/layanan/LayananDetailModal.tsx": "Read‑only modal showing full layanan details including dates, status, asistenmu, and share principals.",
  "frontend/src/components/layanan/LayananUpdateModal.tsx": "Modal for editing a layanan’s share principals, allowing add/remove and saving changes.",
  "frontend/src/components/layanan/ManajemenLayananView.tsx": "Main layanan management page combining the creation form and layanan list with refresh coordination.",
  "frontend/src/components/LockedPanel.tsx": "Displays a disabled panel indicating a locked or unavailable feature.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary that catches runtime errors and shows a fallback UI with reload option.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAsistenmuAssignment.ts": "Provides queries and mutations for fetching Asistenmu candidates and assigning them to Layananku, with cache updates and toast feedback.",
  "frontend/src/hooks/useClientServiceRequests.ts": "Contains hooks for creating client service requests and fetching a client's tasks using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider with login, logout, and identity-loading logic via Dfinity AuthClient.",
  "frontend/src/hooks/useLayananku.ts": "Offers hooks to create, fetch, update, and check status of Layananku records, managing related cache invalidation.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching user profiles and registering clients, partners, or internal users, plus claiming superadmin role.",
  "frontend/src/index.css": "Tailwind CSS base setup defining color tokens and global styles for light and dark themes.",
  "frontend/src/lib/brand.ts": "Exports static paths to brand asset images.",
  "frontend/src/lib/forms/registrationSchemas.ts": "Defines data interfaces and form field metadata for client and partner registration forms.",
  "frontend/src/lib/i18n.ts": "Defines locale types and a large list of translation keys for EN/ID UI text.",
  "frontend/src/lib/whatsapp.ts": "Provides preset WhatsApp messages and utilities to generate encoded WhatsApp contact links.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query client and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with sidebar navigation and multiple admin management sections gated by admin access.",
  "frontend/src/pages/client/ClientDashboardPage.tsx": "Client workspace dashboard with user greeting and tabs for profile, services, requests, and delegation.",
  "frontend/src/pages/internal/AsistenmuDashboardPage.tsx": "Internal dashboard for Asistenmu role showing localized headings and placeholder content.",
  "frontend/src/pages/internal/FinanceDashboardPage.tsx": "Internal Finance workspace dashboard displaying localized summary and placeholder finance content.",
  "frontend/src/pages/internal/InternalRoleMismatchPage.tsx": "Error page shown when internal user role doesn't match workspace, offering navigation back to login.",
  "frontend/src/pages/internal/ManagementDashboardPage.tsx": "Renders a management dashboard wrapped in an AccessGate, showing localized titles and a placeholder card.",
  "frontend/src/pages/internal/SupervisorDashboardPage.tsx": "Displays a supervisor dashboard with localized headers and a placeholder card, protected by AccessGate.",
  "frontend/src/pages/InternalGatePage.tsx": "Implements an internal access code gate with temporary client-side validation and navigation.",
  "frontend/src/pages/InternalLoginPage.tsx": "Handles internal user login, role-based workspace routing, and optional superadmin claiming.",
  "frontend/src/pages/InternalRegisterPage.tsx": "Provides internal user registration flow with role selection and Internet Identity login.",
  "frontend/src/pages/KebijakanPrivasiPage.tsx": "Displays the privacy policy page with brief content and a button to return to the homepage.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero section, service listings, localized text, and WhatsApp links.",
  "frontend/src/pages/LoginPage.tsx": "Login page handling Internet Identity auth, role-based workspace routing, and backend readiness checks.",
  "frontend/src/pages/partner/PartnerDashboardPage.tsx": "Shows a partner dashboard with sidebar navigation, user data display, and menu-based content including profile and summaries.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page for client and partner roles with form handling, validation, and API-driven profile creation.",
  "frontend/src/pages/superadmin/SuperadminDashboardPage.tsx": "Implements a superadmin dashboard with menu-driven sections including summaries, user/task management, and a layanan view.",
  "frontend/src/pages/SyaratKetentuanPage.tsx": "Static terms-and-conditions page with basic text and a button returning to the homepage.",
  "frontend/src/providers/LocaleProvider.tsx": "Provides locale state via context, syncing with localStorage and exposing a hook for reading/updating locale.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes current project state, requirements, architectural notes, issues, and existing features metadata."
}