{
  "kind": "build_request",
  "title": "Activate real internal access-code verification and Superadmin settings to view/update Code A & B",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for real internal access-code verification so that entering Code A routes to \"/internal/login\" (Asistenku masuk) and entering Code B routes to \"/internal/daftar\" (Asistenku daftar). The backend must reject any other code as invalid.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-User-1"
        ],
        "quotes": [
          "1. Kode A = Asistenku masuk Kode B = Asistenku daftar",
          "3. A -> /internal/login B-> /internal/daftar"
        ]
      },
      "acceptanceCriteria": [
        "Calling the backend verification method with the stored Code A returns ok=true and route=\"/internal/login\".",
        "Calling the backend verification method with the stored Code B returns ok=true and route=\"/internal/daftar\".",
        "Calling the backend verification method with any other input returns ok=false (or an equivalent explicit invalid response) without trapping.",
        "The verification method can be called anonymously (since it is used before internal login/register)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend APIs for Superadmin to load/view the current internal access codes and their status, and to update/rotate/change Code A and Code B along with their status.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-User-1"
        ],
        "quotes": [
          "2. Iya superadmin bisa melihat daftar semua kode yang aktif + statusnya dan mengubah kodenya juga"
        ]
      },
      "acceptanceCriteria": [
        "There is a query API that returns a list of internal access codes including: code type (A/B), the code value, last updated timestamp, and a status field.",
        "There is an update API that allows SUPERADMIN to set Code A value, Code B value, and their statuses.",
        "Non-SUPERADMIN callers are rejected (trap or error result) when attempting to view or update codes.",
        "If a status marks a code as inactive/disabled, verification using that code returns invalid."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the mockResponse behavior in frontend InternalGatePage with real backend verification: submit the entered code to the backend and navigate to the backend-provided route only when verification succeeds; otherwise show an invalid-code error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-User-1"
        ],
        "quotes": [
          "Oke aku ingin kamu mengakfifkan logika aslinya"
        ]
      },
      "acceptanceCriteria": [
        "InternalGatePage no longer routes all non-empty codes to \"/internal/login\".",
        "Entering Code A successfully navigates to \"/internal/login\".",
        "Entering Code B successfully navigates to \"/internal/daftar\".",
        "Entering an invalid (or inactive) code shows an error message and does not navigate.",
        "The existing sessionStorage flags (\"internalGatePassed\", \"internalGatePassedAt\") are only set on successful verification, as they are today."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement the Superadmin Dashboard \"Pengaturan\" tab content to load and display a list of all internal access codes (A and B) with their status, and provide controls for Superadmin to update the code values and statuses.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-User-1"
        ],
        "quotes": [
          "mengakfifkan untuk load/view dan mengganti kode A dan B di dashboard superadmin di tab pengaturan",
          "superadmin bisa melihat daftar semua kode yang aktif + statusnya dan mengubah kodenya juga"
        ]
      },
      "acceptanceCriteria": [
        "The placeholder \"Settings coming soon.\" content is replaced with a working settings view under the existing menu item value \"pengaturan\".",
        "The settings view displays Code A and Code B entries, each showing: label, current code value, status, and last updated time.",
        "Superadmin can edit/save the code value and status for Code A and Code B from this screen.",
        "The UI includes loading and error states consistent with other Superadmin cards/pages (spinners/skeletons and readable error text).",
        "All user-facing text introduced in this settings view is in English."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add/extend frontend React Query hooks to call the new backend APIs for verifying internal access codes and for Superadmin to fetch/update the internal access codes; ensure queries are invalidated/refetched after updates so the settings list stays current.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-User-1"
        ],
        "quotes": [
          "mengakfifkan untuk load/view"
        ]
      },
      "acceptanceCriteria": [
        "There is a React Query query for fetching the current internal access codes for Superadmin settings.",
        "There is a React Query mutation for updating codes/statuses and it triggers a refetch/invalidates the codes query on success.",
        "InternalGatePage uses a dedicated function/hook that calls the backend verification method instead of a mock response.",
        "No changes are made to immutable hook paths listed in SYSTEM_CONTEXT (compose via new hooks/files instead)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend/migration.mo only if required to preserve existing stable state when adding new fields/state.",
    "Do not edit files under frontend/src/components/ui (read-only UI components must be composed).",
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts/tsx, frontend/src/main.tsx).",
    "All new user-facing text added by this change must be in English."
  ],
  "nonGoals": [
    "Implementing third-party authentication (only Internet Identity is supported).",
    "Adding new routing paths beyond the existing \"/internal\", \"/internal/login\", and \"/internal/daftar\" routes.",
    "Building full audit-log UI; only code management and verification are in scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}