{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Merge Customer Service approvals into unified internal approval UI and auto-refresh caller profile",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Remove the separate Customer Service Users list and show CUSTOMER_SERVICE users in the same internal pending-approval table and internal users list.",
      "acceptanceCriteria": [
        "`frontend/src/components/superadmin/UserManagementView.tsx` no longer renders a separate “Customer Service Users” section/card.",
        "Pending CUSTOMER_SERVICE users appear in the same “Internal Approval (Pending)” table as other internal roles.",
        "Approving/rejecting a CUSTOMER_SERVICE user uses the same approve/reject action wiring as other internal roles (no separate CS flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/superadmin/UserManagementView.tsx",
          "operation": "modify",
          "description": "Remove the CUSTOMER_SERVICE-specific query/hook usage and the separate “Customer Service Users” UserRoleUsersCard, and ensure the existing InternalPendingRegistrationCard + Internal Users list are fed from the unified internal users data so CUSTOMER_SERVICE appears in both pending approvals and the main internal list."
        },
        {
          "path": "frontend/src/hooks/useSuperadminUserManagement.ts",
          "operation": "modify",
          "description": "Remove or deprecate the CUSTOMER_SERVICE-only helper query (useGetCustomerServiceUsers) so the superadmin UI relies on a single internal users source for lists/approvals; ensure any remaining internal-user queries are keyed consistently to support refetch after approve/reject."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Automatically refresh the caller user profile query so status changes (pending → active) are reflected without manual reload.",
      "acceptanceCriteria": [
        "The React Query for the caller profile (`useGetCallerUser` in `frontend/src/hooks/useQueries.ts`) automatically refetches on an interval (e.g., 5–10 seconds) when appropriate.",
        "After a superadmin approves an internal user, that user’s profile/status UI updates from pending to active automatically without a full page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useGetCallerUser’s React Query options to enable lightweight polling (e.g., 5–10s) when the caller profile is in a state that can change server-side (such as status === 'pending'), while avoiding unnecessary polling for stable states."
        },
        {
          "path": "frontend/src/components/internal/MyProfileCard.tsx",
          "operation": "modify",
          "description": "Ensure the profile/status UI is driven solely by the useGetCallerUser query result (and not one-time derived state) so that automatic refetches correctly re-render status changes from pending to active."
        }
      ]
    }
  ]
}