{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Activate real internal access-code verification and Superadmin settings UI for Code A & B",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Replace InternalGatePage mock verification with real backend verification and route only on success.",
      "acceptanceCriteria": [
        "InternalGatePage no longer routes all non-empty codes to \"/internal/login\".",
        "Entering Code A successfully navigates to \"/internal/login\".",
        "Entering Code B successfully navigates to \"/internal/daftar\".",
        "Entering an invalid (or inactive) code shows an error message and does not navigate.",
        "The existing sessionStorage flags (\"internalGatePassed\", \"internalGatePassedAt\") are only set on successful verification, as they are today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InternalGatePage.tsx",
          "operation": "modify",
          "description": "Remove mockResponse logic and call a real React Query mutation (e.g., useVerifyInternalAccessCode) that submits the entered code to the backend verification method; on success set sessionStorage flags and navigate to the backend-provided route; on invalid show an error and do not navigate. Ensure any newly introduced user-facing text remains English."
        },
        {
          "path": "frontend/src/hooks/useInternalAccessCodes.ts",
          "operation": "create",
          "description": "Add a dedicated React Query mutation hook for anonymous internal access-code verification that calls the backend verification method and returns success/route vs invalid; designed for use by InternalGatePage."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement Superadmin Dashboard \"Pengaturan\" tab to view and update internal access codes A/B with status and timestamps.",
      "acceptanceCriteria": [
        "The placeholder \"Settings coming soon.\" content is replaced with a working settings view under the existing menu item value \"pengaturan\".",
        "The settings view displays Code A and Code B entries, each showing: label, current code value, status, and last updated time.",
        "Superadmin can edit/save the code value and status for Code A and Code B from this screen.",
        "The UI includes loading and error states consistent with other Superadmin cards/pages (spinners/skeletons and readable error text).",
        "All user-facing text introduced in this settings view is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/superadmin/SuperadminInternalAccessCodesSettingsView.tsx",
          "operation": "create",
          "description": "Create a Superadmin settings view component that loads internal access codes (A and B), displays label/code/status/last-updated, and provides inputs/selects plus a Save action to update code values and statuses. Include loading and error states consistent with existing Superadmin cards. Use existing composed UI primitives (do not edit files under frontend/src/components/ui). All newly introduced user-facing text must be English."
        },
        {
          "path": "frontend/src/pages/superadmin/SuperadminDashboardPage.tsx",
          "operation": "modify",
          "description": "Replace the \"Settings coming soon.\" placeholder under activeMenu === \"pengaturan\" by rendering the new SuperadminInternalAccessCodesSettingsView, and adjust the card title/description as needed (any newly introduced text in English). Ensure the view remains under the existing menu item value \"pengaturan\" and does not add new routes."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add/extend React Query hooks for access-code verification and Superadmin fetch/update of codes, including refetch after updates.",
      "acceptanceCriteria": [
        "There is a React Query query for fetching the current internal access codes for Superadmin settings.",
        "There is a React Query mutation for updating codes/statuses and it triggers a refetch/invalidates the codes query on success.",
        "InternalGatePage uses a dedicated function/hook that calls the backend verification method instead of a mock response.",
        "No changes are made to immutable hook paths listed in SYSTEM_CONTEXT (compose via new hooks/files instead)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useInternalAccessCodes.ts",
          "operation": "modify",
          "description": "Extend the internal access code hooks module to include: (1) a React Query query for SUPERADMIN to fetch all internal access codes for settings, and (2) a React Query mutation to update/rotate/change Code A and Code B values and statuses, invalidating/refetching the codes query on success. Ensure hooks are composed via new file(s) and do not modify immutable hook paths."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update frontend TypeScript backend type declarations to reflect the new/updated backend capabilities for internal access code verification and Superadmin code management (including code status fields) so the new hooks and settings UI can compile against the updated canister interface."
        }
      ]
    }
  ]
}