{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Backend includes internal registration/login/approval flows; current work focuses on fixing an internal registration bug where user IDs are generated from caller principal causing overwrites, and ensuring CUSTOMER_SERVICE is treated consistently as an internal role.",
  "architectural_notes": [
    "Internal userId generation in registerInternalUser must be unique per created user (use an internal counter or equivalent), not derived from caller principal, to prevent overwriting userProfilesById.",
    "Add minimal safety guard in registerInternalUser to avoid silent overwrite if a generated userId already exists.",
    "CUSTOMER_SERVICE must be treated the same as other internal roles in register/login/approval flows; avoid special DTO/paths that lose or alter role/status."
  ],
  "known_issues": [
    "Bug: registerInternalUser uses userId = \"INT-\" + caller principal, causing all internal registrations by the same SUPERADMIN to overwrite each other; leads to incorrect role/status (e.g., everyone appears as CUSTOMER_SERVICE pending)."
  ],
  "isFixRequest": true,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix internal registration bug: generate unique internal user IDs (counter-based, not caller principal), prevent overwrites in userProfilesById/byPrincipal, and ensure CUSTOMER_SERVICE is handled consistently as a normal internal role",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Update `backend/main.mo` `registerInternalUser(role, name, email, whatsapp)` to generate a unique internal user ID that does not depend on the caller Principal (replace any `\"INT-\" # caller.toText()` strategy). Use an internal counter-based strategy so a single SUPERADMIN can register multiple internal users without overwriting entries in `userProfilesById`.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure the internal ID counter used by `registerInternalUser` remains safe across canister upgrades so it does not reset to a value that could collide with existing `INT-*` IDs already stored in `userProfilesById`. If an upgrade/migration step is necessary under current state persistence, add the minimal conditional migration to preserve or recompute the counter from existing stored profiles.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Add a minimal safety guard in `registerInternalUser` to prevent silent overwrite in `userProfilesById`: if the newly generated `userId` already exists in `userProfilesById`, the function must not overwrite the existing profile (e.g., retry generating the next counter value until free, or trap with a clear error).",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Keep `registerInternalUser` authorization exactly as it currently is: it must remain callable only by a caller whose existing profile role is `SUPERADMIN`, and anonymous callers must be rejected.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Make `CUSTOMER_SERVICE` handling fully consistent with other internal roles in backend registration and returned/listed data: when `registerInternalUser` is called with role `CUSTOMER_SERVICE`, it must create the same `UserProfile` structure as other internal roles (role preserved as `CUSTOMER_SERVICE`, status `#pending`, stored in both `userProfilesById` and `userProfilesByPrincipal`). Remove/avoid any special-case DTO or list/return path that causes CUSTOMER_SERVICE users to lose role information or be treated differently from other internal roles.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix internal registration overwrite bug (unique INT IDs + CUSTOMER_SERVICE consistency)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}