{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Patch to refactor internal user approval flow (backend + superadmin dashboard) to be unified and role-agnostic based on existing `internalRoles` in `main.mo`, plus frontend real-time status refresh so approved users see status update without manual refresh.",
  "architectural_notes": [
    "Backend approval queries must use the existing `internalRoles` variable in `main.mo` (line ~458); do not introduce a new roles set for approval logic.",
    "Approval workflow should be generic for any role contained in `internalRoles` (single pending query + single approve path).",
    "Frontend status synchronization via lightweight polling (no WebSocket assumed)."
  ],
  "known_issues": [
    "User profile/status UI can remain 'pending' after backend approval until refresh (needs polling/refetch).",
    "Superadmin dashboard currently separates Customer Service users into a different list, causing inconsistent approval flow."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-frontend-superadmin-dashboard-remove-the-separate-customer-service-users-list-and-merge-customer-service-users-into-the-main-internal-user-management-flow-so-that-pending-approvals-for-customer-service-appear-in-the-same-internal-approval-pending-table-and-the-same-internal-users-list-as-other-internal-roles",
      "title": "Frontend (Superadmin dashboard): Remove the separate “Customer Service Users” list and merge CUSTOMER_SERVICE users into the main internal user management flow so that pending approvals for CUSTOMER_SERVICE appear in the same “Internal Approval (Pending)” table and the same internal users list as other internal roles.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-frontend-status-refresh-add-lightweight-automatic-refresh-for-the-current-user-profile-query-so-that-when-an-internal-user-s-backend-status-changes-e-g-pending-active-after-approval-the-ui-updates-without-requiring-a-manual-refresh-polling-is-acceptable",
      "title": "Frontend (Status refresh): Add lightweight automatic refresh for the current user profile query so that when an internal user’s backend status changes (e.g., `pending` → `active` after approval), the UI updates without requiring a manual refresh (polling is acceptable).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Backend: Refactor Superadmin approval logic to use existing `internalRoles` Set in main.mo (line ~458) as sole source; unified pending query for roles in set with status='pending'; generic approveUser updates status to 'active' for any internal role without role-specific branching.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Frontend: Superadmin dashboard approval UI—merge Customer Service users into main internal pending list/table; remove separate CS section; approve action uses universal backend approve; refetch to sync after approval.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Frontend: Add lightweight polling (e.g., every 5–10s) on user profile/status view to reflect backend status changes (pending→active) automatically without manual refresh; keep status badge consistent.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Backend: Refactor internal approval querying to use the existing `internalRoles` Set already defined in `backend/main.mo` at line 458 as the only source of truth for determining which roles are “internal” for approval purposes; do not create any new role set/variable for this purpose.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Backend: Implement a unified pending-approval query for internal users that returns ONLY users whose `role` is contained in the existing `internalRoles` Set and whose `status` is `pending`, with no role-specific branching (e.g., no separate handling for CUSTOMER_SERVICE or FINANCE).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Backend: Ensure the internal-user approval action is role-agnostic for any role contained in `internalRoles` and, when an internal user is approved, their `UserProfile.status` is updated to `active` immediately (no special-casing for specific internal roles).",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Unify internal user approval flow using existing internalRoles and merge CS approvals into main list",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}